SaitovSP/src/DataProcessors/АрмКурьера/АрмКурьера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АрмКурьера</name>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.Заказы</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Курьер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыБлюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Повар</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаОтБлюд</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

SaitovSP/src/Enums/СтатусЗаказа/СтатусЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказа</name>
  <enumValues>
    <name>ГотовДляДоставки</name>
  </enumValues>
  <enumValues>
    <name>ВДоставке</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>НеДоставлен</name>
  </enumValues>
</mdclass:Enum>

SaitovSP/src/Documents/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказы</name>
  <registerRecords>InformationRegister.ИсторияОтказовОтБлюд</registerRecords>
  <registerRecords>InformationRegister.РезервСтолов</registerRecords>
  <registerRecords>AccumulationRegister.СуммаЗаказовКлиенты</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоЗаказовАкция</registerRecords>
  <attributes>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтола</name>
    <type>
      <types>CatalogRef.Столы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидочнаяКарта</name>
    <type>
      <types>CatalogRef.СкидочныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаСертификатом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СертификатОплаты</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРезерва</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовДляДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеУспешнойДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыдачиЗаказаКурьеру</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Блюда</name>
    <attributes>
      <name>Блюдо</name>
      <type>
        <types>CatalogRef.Блюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыБлюда</types>
      </type>
    </attributes>
    <attributes>
      <name>Повар</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>CatalogRef.ПричиныОтказаОтБлюд</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <owners>Catalog.Рестораны</owners>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.Разряды</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/Catalogs/Должности/Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Должности</name>
  <predefined>
    <items>
      <name>Бухгалтер</name>
      <description>Бухгалтер</description>
    </items>
    <items>
      <name>ДиректорРесторана</name>
      <description>Директор ресторана</description>
    </items>
    <items>
      <name>ДиректорСети</name>
      <description>Директор сети</description>
    </items>
    <items>
      <name>Курьер</name>
      <description>Курьер</description>
    </items>
    <items>
      <name>Менеджер</name>
      <description>Менеджер</description>
    </items>
    <items>
      <name>Официант</name>
      <description>Официант</description>
    </items>
    <items>
      <name>Повар</name>
      <description>Повар</description>
    </items>
  </predefined>
</mdclass:Catalog>

SaitovSP/src/DataProcessors/АрмКурьера/Forms/Форма1/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Обновить", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора (Результат, ДополнительныеПраметры) Экспорт
	
	Статус = ПолучитьЗначениеСтатусаЗаказа("ВДоставке");
	ВызовЗаписиДокумента(Элементы.Реквизит1.ТекущиеДанные.Ссылка, Результат, Статус);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьЗаказ(Команда)

	СсылкаНаЭлементСправочника = Элементы.Реквизит1.ТекущиеДанные.Ссылка;
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаЭлементСправочника);
	ОткрытьФорму("Документ.Заказы.Форма.ФормаЗаказаНаДоставку", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйЗаказ(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Официант", ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь());
	ОткрытьФорму("Документ.Заказы.Форма.ФормаЗаказаНаДоставку", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКурьера(Команда)
	
	Если Не Элементы.Реквизит1.ТекущиеДанные.ГотовДляДоставки Тогда
		Сообщить("Заказ не готов для доставки");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элементы.Реквизит1.ТекущиеДанные.Курьер) Тогда
		Сообщить("Курьер уже назначен!");
		Возврат;
	КонецЕсли;
	
	ЗначениеОтбора = Новый Структура;
	ЗначениеОтбора.Вставить("Должность", ЗначениеОтбора());
	ЗначениеОтбора.Вставить("Ресторан", Элементы.Реквизит1.ТекущиеДанные.Ресторан);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);

    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОбработкаВыбора", ЭтотОбъект);    
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора",ПараметрыВыбора,,,,,ОписаниеОповещенияОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура Доставлен(Команда)
	
	Если Элементы.Реквизит1.ТекущиеДанные.СтатусЗаказа = ПолучитьЗначениеСтатусаЗаказа("ВДоставке") Тогда
		Статус = ПолучитьЗначениеСтатусаЗаказа("Доставлен");
		ВызовЗаписиДокумента(Элементы.Реквизит1.ТекущиеДанные.Ссылка, Элементы.Реквизит1.ТекущиеДанные.Курьер, Статус);
	Иначе
		Сообщить("Заказ не готов для доставки или уже доставлен!");//Надо разделять ошибки
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВызовЗаписиДокумента(Ссылка, Курьер, Статус)
	Документы.Заказы.ЗаписьНазначенияКурьера(Ссылка, Курьер, Статус);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеСтатусаЗаказа(Статус)
	Возврат Перечисления.СтатусЗаказа[Статус];
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеОтбора()
	Возврат Справочники.Должности.Курьер;	
КонецФункции

&НаКлиенте
Процедура Обновить()
	
	Элементы.Реквизит1.Обновить();
	
КонецПроцедуры

#КонецОбласти
